const button_div = document.getElementById('button');
const quote_section = document.getElementById('message');
const quotes = [
  'ใบที่ยี่สิบหกเปรียบใกล้ดอกไม้บาน ถึงมีการทุกข์ร้อนจงผ่อนผัน สุดแท้แต่บุญกรรมเป็นสำคัญ ตัวเรานั้นต้องเจียมเสงี่ยมตัว จะทำการสิ่งใดอย่าได้หาญ ขืนรำคาญฮึกฮักว่าจักชั่ว ต่อภายหลังจักต้องหม่นหมองมัว คิดถึงตัวถึงกายไม่วายวัน เปรียบเหมือนเราปลูกต้นผลไม้ คนอื่นได้เก็บกินไม่ผินผัน แม้นถามบุตรสุดใจที่ในครรภ์ ว่าบุตรนั้นเป็นหญิงจริง ๆ ถามเป็นใจความว่าเห็นพอเป็นกลาง ถามคนพึ่งพาท่านว่าห่าง ถามหาลาภบอกไว้ไม่อำพราง ให้ยับยั้งยอมสยบจบความเอยฯ',
  'ใบที่หนึ่งสมมาทปรารถนา ทายไว้ว่ามีคนชุบอุปถัมภ์ หมายสิ่งใดที่ในจิตต์คิดจะทำ ว่าคงสำเร็จการประมาณมี แต่ช้า ๆ จึงจะสมอารมณ์ปองทั้งพวกพ้องปรีเปรมเกษมศรี ว่าอยู่เย็นเป็นสุข ทุกเดือนปี แม้นใบนี้ถามโรคที่โศรกกาย ว่าคงจะเบาบางเหมือนอย่างว่า หรือถามหาลูกหนี้พี่น้องหายว่าคงจะพบพักตร์เหมือนทักทาย หรือถามหมายหาลาภไม่หยาบคำ ว่าช้า ๆ คงจะสมอารมณ์นึก ได้ ก้องกึกเหล่ากอเป็นข้อขำ ถามหาคู่ดีนักเหมือนชักนำขอจบคำที่หนึ่งรำพึงเอยฯ'
];

function newQuote() {
  const randomNumber = Math.floor(Math.random() * quotes.length);
  quote_section.innerHTML = quotes[randomNumber];
}

function main() {
  button_div.addEventListener('click', () => newQuote());
}

main();
